GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart_v2.c
    /* enable usart idle interrupt */
    usart_interrupt_enable(uart->periph, USART_INT_IDLE);

    /* enable dma receive */
#if defined SOC_SERIES_GD32F5xx
    usart_dma_receive_config(uart->periph, USART_DENR_ENABLE);
#else
    usart_dma_receive_config(uart->periph, USART_RECEIVE_DMA_ENABLE);
#endif
    #endif
}

static void _uart_dma_transmit (struct gd32_uart *uart, rt_uint8_t *buffer, rt_uint32_t size)
{
    #if defined SOC_SERIES_GD32E23x
    DMA_CHMADDR(uart->dma.tx.channel) = (uint32_t)buffer;
    DMA_CHCNT(uart->dma.tx.channel) = size;

    usart_dma_transmit_config(uart->periph, USART_DENT_ENABLE);

    gd32_dma_channel_enable(uart->dma.tx.periph, uart->dma.tx.channel);
    #else
    /* Set the data length and data pointer */
    gd32_dma_memory_address_config(uart->dma.tx.periph, uart->dma.tx.channel, DMA_MEMORY_0, (uint32_t)buffer);
    gd32_dma_transfer_number_config(uart->dma.tx.periph, uart->dma.tx.channel, size);

    /* enable dma transmit */
#if defined SOC_SERIES_GD32F5xx
    usart_dma_transmit_config(uart->periph, USART_DENT_ENABLE);
#else
    usart_dma_transmit_config(uart->periph, USART_TRANSMIT_DMA_ENABLE);
#endif

    /* enable dma channel */
    gd32_dma_channel_enable(uart->dma.tx.periph, uart->dma.tx.channel);
    #endif
}

static void gd32_dma_config (struct rt_serial_device *serial, rt_ubase_t flag)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    RT_ASSERT(flag == RT_DEVICE_FLAG_DMA_TX || flag == RT_DEVICE_FLAG_DMA_RX);

    /* enable tx dma */
    if (flag == RT_DEVICE_FLAG_DMA_TX)
    {
        #if defined SOC_SERIES_GD32E23x
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_G);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_FTF);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_HTF);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_ERR);
        gd32_dma_channel_disable(uart->dma.tx.periph, uart->dma.tx.channel);
        gd32_dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);
        /* configure receive DMA */
        rcu_periph_clock_enable(uart->dma.tx.rcu);
        gd32_dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);

        gd32_dma_single_data_parameter_struct dma_init_struct;

        gd32_dma_single_data_para_struct_init(&dma_init_struct);
        dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(uart->periph);
        dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
        dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
        dma_init_struct.direction = DMA_MEMORY_TO_PERIPH;
        dma_init_struct.priority = DMA_PRIORITY_HIGH;
        GD32_DMA_SET_DATAWIDTH(&dma_init_struct, DMA_PERIPH_WIDTH_8BIT);

        gd32_dma_single_data_mode_init(uart->dma.tx.periph, uart->dma.tx.channel, &dma_init_struct);

        /* enable tx dma interrupt */
        nvic_irq_enable(uart->dma.tx.irq, 2);

        /* enable transmit complete interrupt */
        gd32_dma_interrupt_enable(uart->dma.tx.periph, uart->dma.tx.channel, DMA_INT_FTF);
        #else
        /* clear all the interrupt flags */
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_FEE);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_SDE);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_TAE);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_HTF);
        gd32_dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_FTF);
        gd32_dma_channel_disable(uart->dma.tx.periph, uart->dma.tx.channel);
        gd32_dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);

        /* configure receive DMA */
        rcu_periph_clock_enable(uart->dma.tx.rcu);
        gd32_dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);

        gd32_dma_single_data_parameter_struct dma_init_struct;

        gd32_dma_single_data_para_struct_init(&dma_init_struct);
        dma_init_struct.periph_addr         = (uint32_t)&USART_DATA(uart->periph);
        dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
        dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
        dma_init_struct.direction           = DMA_MEMORY_TO_PERIPH;
        dma_init_struct.priority            = DMA_PRIORITY_HIGH;
        GD32_DMA_SET_DATAWIDTH(&dma_init_struct, DMA_PERIPH_WIDTH_8BIT);
        gd32_dma_request_config(&dma_init_struct, &uart->dma.tx);
        gd32_dma_single_data_mode_init(uart->dma.tx.periph, uart->dma.tx.channel, &dma_init_struct);
        gd32_dma_subperiph_config(uart->dma.tx.periph, uart->dma.tx.channel, &uart->dma.tx);
        gd32_dma_circulation_disable(uart->dma.tx.periph, uart->dma.tx.channel);

        /* enable tx dma interrupt */
        nvic_irq_enable(uart->dma.tx.irq, 2, 0);

        /* enable transmit complete interrupt */
        gd32_dma_interrupt_enable(uart->dma.tx.periph, uart->dma.tx.channel, DMA_CHXCTL_FTFIE);
        #endif
    }

    /* enable rx dma */
    if (flag == RT_DEVICE_FLAG_DMA_RX)
    {
        rt_uint8_t *ptr = NULL;
        rt_hw_serial_control_isr(serial, RT_HW_SERIAL_CTRL_GET_DMA_PING_BUF, (void *)&ptr);

        /* start dma transfer */
        _uart_dma_receive(uart, ptr, serial->config.dma_ping_bufsz);
    }
}

#endif

/**
  * @brief  uart control
  * @param  serial, arg
  * @retval None
  */
static rt_err_t gd32_uart_control (struct rt_serial_device *serial, int cmd, void *arg)
{
    struct gd32_uart *uart;

    rt_ubase_t ctrl_arg = (rt_ubase_t)arg;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    if (ctrl_arg & (RT_DEVICE_FLAG_RX_BLOCKING | RT_DEVICE_FLAG_RX_NON_BLOCKING))
    {
        if (uart->uart_dma_flag & RT_DEVICE_FLAG_DMA_RX)
            ctrl_arg = RT_DEVICE_FLAG_DMA_RX;
        else
            ctrl_arg = RT_DEVICE_FLAG_INT_RX;
    }
    else if (ctrl_arg & (RT_DEVICE_FLAG_TX_BLOCKING | RT_DEVICE_FLAG_TX_NON_BLOCKING))
    {
        if (uart->uart_dma_flag & RT_DEVICE_FLAG_DMA_TX)
            ctrl_arg = RT_DEVICE_FLAG_DMA_TX;
        else
            ctrl_arg = RT_DEVICE_FLAG_INT_TX;
    }

